Tekla Open API Reference for Tekla Structures 2025
FormBase.ApplyValues Method
 Loads the dialog values from a file and performs Apply() on the loaded values. To match the files to a certain dialog, the file suffix is set as the dialog type's name.
 Namespace: Tekla.Structures.Dialog
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public void ApplyValues(
	string FileName
)
Public Sub ApplyValues (
	FileName As String
)
Parameters
FileName
Type: System.String
The name of the file.
See Also
Reference
FormBase Class
Tekla.Structures.Dialog Namespace